app/Filters/ThreadFilters.php

        protected function by()
        {
            $user = User::where('name', $this->request->by)->firstOrFail();
---
select * from `users` where `name` = '96andl' limit 1