app/Providers/ComposerServiceProvider.php

    public function boot()
    {
        View::composer('*', function ($view) {
           $view->with('channels', Channel::all());
---
select * from `channels`